function solution(storey) {
    // 2554 -1 4
    // 2550 -10 5
    // 2500 -100 5
    // 2000 -1000 2
    // 0
    
    // 2554 -1 4  - 10 나눈 나머지 4
    // 2550 10 5  - 100 나눈 나머지 50
    // 2600 100 4  - 1000 나눈 나머지 600
    // 3000 -1000 3  - 
    // 0
    
    // 2454 -1 4
    // 2450 -10 5 - 5일때는 그 다음 큰 자릿수 고려해야함
    // 2400 -100 4
    // 2000 -1000 2
    
    let n = storey;
    let cnt = 0;
    let k = 10;
    while (n) {
        const r = (n % k) / (k / 10);

        if (r) {
            if (r < 5) {
                n -= r * (k / 10);
                cnt += r;
            }
            else if (r > 5) {
                n += (10 - r) * (k / 10);
                cnt += (10 - r);
            }
            else {
                // 다음 자릿수
                const m = Math.floor((n % (k * 10)) / k);
                if (m < 5) {
                    n -= r * (k / 10);
                    cnt += r;
                }
                else {
                    n += (10 - r) * (k / 10);
                    cnt += (10 - r);
                }
            }
        }
        k *= 10;
    }
    return cnt;
}